---
kind: property
id: P:Autodesk.Revit.DB.ModelPath.ServerPath
source: html/4f4b7343-c95a-a887-9dc8-6665839175b4.htm
---
# Autodesk.Revit.DB.ModelPath.ServerPath Property

Whether this path is a server path (as opposed to a file path or cloud path)

## Syntax (C#)
```csharp
public bool ServerPath { get; }
```